Tekla Open API Reference for Tekla Structures 2025
Plugin.TryGetAttribute Method (String, String)
 Gets the value of the specified string attribute of the plug-in.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TryGetAttribute(
	string FieldName,
	ref string FieldValue
)
Public Function TryGetAttribute (
	FieldName As String,
	ByRef FieldValue As String
) As Boolean
Parameters
FieldName
Type: System.String
The name of the attribute to get.
FieldValue
Type: System.String
The value of the attribute.
Return Value
Type: Boolean
True on success.
See Also
Reference
Plugin Class
TryGetAttribute Overload
Tekla.Structures.Drawing Namespace